Repository: joshanashakya/literature_review
Catalog: workspace/opus_corpus/wikimediav20210402(2.8k)/en-ne.tmx
Source language: en
Languages: ne

source: The most famous of these stories is the one mentioned in Markandeya Purana. According to this legend, Harishchandra gave away his kingdom, sold his family and agreed to be a slave – all to fulfill a promise he had made to the sage Vishwamitra.
ne: सबैभन्दा प्रख्यात कथा मार्कण्डेय पुराणमा पाइन्छ , जुन कथा मा विश्वामित्र ऋषिलाई वचन पुरा गर्न उनले आफ्नो राज्य, रानी र पुत्रलाई बेच्नु पर्ने हुन्छ र आफु चण्डालको दास बन्नुपर्ने हुन्छ ।

source: As a result of this boon, a son named Rohita (or Rohitaswa) was born to the king. After his birth, Varuna came to Harishchandra and demanded that the child be sacrificed to him. The king postponed the sacrifice multiple times citing various reasons, but finally agreed to it when Rohita became an adult.
ne: ऐतरेय ब्राह्मणको कथा अनुसार , हरिशचन्द्रको १०० पत्नी थिए तर कुनै सन्तान थिएनन् । नारद मुनिको आज्ञा अनुसार उनले , वरुणको प्राथना गर्छन । वरुणले उनलाई पुत्र प्रदान गर्न मन्जुर भए तर उनले उक्त पुत्रको बलि चडाउनु पर्ने साट्न राखे । बरुणको वरदानले पुत्र पैदा भए र उनको नाम रोहित राखियो । तब वरुण आए र पुत्रको बलि मागे । राजाले बिभिन्न बहाना बनाउदै धेरै पातक टार्दै गए । रोहित जब ठुलो भए र यो कुरा थाहा पाए तब उनी भागे र जंगलमा लिकं गए । वरुणले रिसाएर उनलाई पेट सम्बन्धि बिमारीको श्राप दिए । रोहितको बदलामा अन्य कोहिको बलि दिने उपाय कसैले देखाए । अजिगर्त नामक एक गरिब र दरिद्र ब्राह्मणको तीन पुत्र थिए । उनले यदि सय गाई पाए आफ्नो एक छोरा बलिको लागि दिने कुरा बताए । जेठ छोरा बाबुको तिर लागे भने कान्छा छिरा आमाको तिर लागे र महिला छोरा शुनःशेपलाई ब्राह्मणले बेची दिए । शुन:शेप ले विश्वामित्र ऋषिको सुझावमा ऋग वेदका मन्त्रोच्चारण गरे र बलि हुन बाट जोगिए । उनको प्राथना बाट हरिशचन्द्रको बिमारी समेत निको भयो ; शुन:शेपलाई विश्वामित्र ऋषिले धर्म पुत्र पाले।

source: Vighnaraja was trying to disturb the tapasya (meditation) of the sage Vishwamitra. When he saw Harishchandra, he entered the king's body and started abusing Vishwamitra. This disturbed Vishwamitra's tapasya, and destroyed all the knowledge that the sage had acquired during this tapasya.
ne: राजा हरिशचन्द्र त्रेता युगका एक प्रजापलक राजा थिए । उनको शैव्या (तारामती) नामकी रानी र रोहित नामको छोरा थिए । एक पटक सिकार खेल्न जाँदा बाटो भुले । उनले विश्वामित्र ऋषिलाई देखे र सहयोग गर्न याचना गरे ।

source: He let go of all his possessions – even his clothes. As he readied to leave his palace with his family, Vishwamitra demanded another donation. Harishchandra said that he did not have any possession left, but promised to make another donation within a month.
ne: सहयोग गरे बापत इच्छा गरेको पुरा गरि दिने वचन उनले दिए ।ऋषिले उनलाई फिर्ता जाने बाटो देखाईदिए । केहि समय बितेपछी ऋषि उनको दरबारमा गए र उनले दक्षिणा मागे र राजसुय यज्ञ गर्न लगाए । ऋषिले राजाको सम्पूर्ण राज्य जाय जेथा श्री-सम्पति माग राखे । हरिशचन्द्रले मन्जुर गरे र महल र दरबार छोडेर परिवार सहित हिंडे ।

source: When Vishwamitra saw the king with his subjects, he started cursing Harishchandra for taking along his subjects (who were a part of the kingdom donated to the sage). The king then decided to leave the kingdom with his family. To make them go away sooner, Vishwamitra started beating the queen with a stick.
ne: राजमहल छोडेपछी हरिशचन्द्र गरिवी र दरिद्रता मा बस्न थाले । उन प्रति बफादार उनका समर्थक तथा शुभचिन्तक हरुले उनलाई पछ्याउन थाले । जब विश्वामित्र ऋषिले यो देखे विश्वामित्रले उनले आफ्नो राज्यको अंगको रुपमा रहेकालाई आफ्नो समर्थक बनाएर हिदाएओ गुनासो गरे र आफ्नो राज्यमा नबस्न भने । राजाले ऋषिलाई दिएको आफ्नो राज्यबाट अन्त जाने निर्णय गरे । ऋषिले उनलाई अपमान गरे । यो देखेर पाँच दिक्पालले विश्वामित्रको निन्दा गरे । विश्वामित्रले दिक्पाललाई अर्को जन्ममा मानव भएर जन्मनु पर्ने श्राप दिए र उनीहरु पाण्डव र द्रौपदीका पुत्र भएर जन्मे ।

source: His wife Shaivya suggested that he sell her to get some money. After some hesitation, Harishchandra accepted the proposal and sold her to an elderly man. Their child would not let go of his mother, so it was decided that he would accompany his mother (and an extra payment was made for him).
ne: आफ्नो राज्य बाट हिंडेको झन्डै एक महिना पछी, हरिशचन्द्र काशी पुगे जहाँ विश्वामित्र पुगिसकेका थिए । उनले राजाले दिएको वचन अनुसर भिक्षा माग गरे । राजाले केहि समय मागे र ऋषिले अर्को सुर्यास्त सम्ममा आफुलाई सो दान चाहिने कुरा राखेर हिँडे । एकातिर भोको छोरो रोहिरहेको छ भने अर्को तिर ऋषिलाई दिएको वचन कसरि पुरा गर्ने भन्ने चिन्ताले राजालाई निकै सतायो । रानीले उनलाई बेचेर केहि पैसा आउने प्रस्ताव गरिन् । केहि संकोच मानेर हरिशचन्द्रले रानी शैव्यालाई बेचे तर छोरा आमा छाड्न तयार थिएनन् र छोरा आमा संगै लग्यो ।

source: An outcaste chandala (actually the deity of dharma in disguise) offered to buy him, but Harishchandra's self-respect as a high-caste Kshatriya would not allow this. He instead offered to be Vishwamitra's slave. Vishwamitra agreed, but then declared "Since you are my slave, you must obey me.
ne: तत्कालै , विश्वामित्र उनको अगाडी देखा परे र दाङको माग गरे । रानी र छोरालाई बेचेर प्राप्त भएको सबै पैसा उनले ऋषिलाई दिए ।तर , विश्वामित्र अझै सन्तुष्ट थिएनन् । हरिशचन्द्रले आफैलाई बेच्ने निर्णय गरे । एउटा तल्लो जातिको चण्डाल ले उनलाई किन्ने भने , तर राजा आफु क्षत्रिय भएको नाताले आत्मा-सम्मानको कारण त्यो चाहेनन् । बरु उनले आफु विश्वमित्रको दास हुने प्रस्ताव राखे । विश्वमित्रले मन्जुर गर तर तत्कालै भने " तिमि मेरो दास भएको हुनाले , तिमीले मैले भनेको मान्नु पर्छ । म तिमीलाई यो चण्डालको हातमा बेच्छु । चण्डालले ऋषिलाई सुनको सिक्का दिए र हरिशचन्द्र उनको दास भए ।

source: He directed Harishchandra to collect fees for every body cremated there: a part of the fee would go to the chandala, a part would be given to the local king, and the rest would be Harishchandra's remuneration. Harishchandra started living and working at the cremation ground. One day, he dreamed about his past lives, and realized that his current condition was a result of his past sins.
ne: चण्डालले हरिशचन्द्रलाई चिहान खन्न काम लगाउथ्यो । उनले त्यहाँ दाहसंस्कार गरिने प्रत्येकको पैसा लिनलाई लगाएको थियो : त्यसको केहि हिस्सा चण्डाललाई जान्थ्यो, केहि स्थानीय प्रशासनलाइ पुग्थ्यो र बाँकी हरिशचन्द्रको पारिश्रमिक थियो । हरिशचन्द्र चिहानमा बस्न र काम गर्न थाले । एक दिन उनले आफ्नो पहिले को जीवन र अहिलेको अवस्थाको बारेमा सपना देखे र अहिले भोग्नु परेको अवस्थालाई पहिलेको जीवनको पापको रुपमा लिए । सपनामा उनले रानीलाई रोइरहेको देखे । उनी बिउझिए । जब उनी बिउझिए , उनले आफ्नो अगाडी एक महिला रोइरहेको देखे । उनले आफ्नो छोरालाई बोकिरहेकी थिइन् जसको सर्पले डसेर मृत्यु भएको थियो । नजिकै गएर हेर्दा ती महिला उनकै रानी शैव्या थिइन् र छोरा रोहितको सर्पले डसेर मृत्यु भएको थियो । आफ्नो दुर्भाग्य देखेर , हरिशचन्द्रलाई आत्महत्या गर्न मन लाग्यो , तार उनले अर्को जन्ममा पनि यसको फल भोग्नु पर्ने महसुस गरे ।

source: But, Harishchandra told her that he would not let her do so without paying the fee. At that time, all the deities appeared led by the deity of Dharma and accompanied by Vishwamitra. They praised Harishchandra for his good qualities, and invited him to heaven.
ne: जब रानीले छोराको दाहसंस्कार गर्ने सुरसार गरिन् , हरिशचन्द्रले यो बताएकि उनले पैसा नदिए सम्म हरिशचन्द्रले उनलाई दाहसंस्कार गर्न दिन सक्दैनन् । त्यो बेला धर्म सहित सबै देवी देवता र विश्वामित्र उपस्थित भए । उनीहरुले हरिशचन्द्रको सत्य बादी गुण र सत्गुणको प्रशंसा गरे र उनलाई स्वर्गमा निम्त्याए ।

source: Harishchandra's daughter, Padmini is the wife of the Haihaya king Kritavirya. Her son is Kartavirya Arjuna, who was slain by Parashurama.
ne: हरिशचन्द्रको छोरी, पद्मिनीको विवाह हैहाया राजा क्रितविर्य संग भएको थियो । उनीहरुको कार्ताविर्य अर्जुन नामको छोरा थियो , जसको बध परशुराम ले गरेका थिए ।

source: In Mahabharata, Narada tells Yudhishthira that Harishchandra is a rajarshi (king-sage), and the only earthly king who finds a place in the assembly of gods. According to Narada, Harishchandra was a powerful emperor, and all the kings on earth accepted his suzerainty. He performed the rajasuya yajna.
ne: महाभारतमा, नारद ले युधिष्ठिरलाई " हरिशचन्द्र राजर्षी रहेको र देवताहरुको सभामा स्थान पाएका एक मात्र संसारिक राजा भएको " कुरा बताएका थिए । नारदका अनुसार , हरिशचन्द्र एक शक्तिशाली सम्राट थिए र उनको अधिपत्यलाइ सबै राजाहरुले स्वीकार गरेका थिए । उनले राजासुय यज्ञ सम्पन्न गरेका थिए र ब्राह्मण हरुलाई उनीहरुले चाहेको दक्षिण र गर गहन दिएका थिए । यस कारण उनल्लाई इन्द्रको स्थान मिलेको थियो ।

source: Allies
ne: मित्र

source: Encounter with Ravana
ne: रावणसंग लडाई

source: Encounter with Parashurama
ne: परशुरामसंग लडाई

source: This is his patronymic, by which he is best known; he is also referred to simply as Arjuna. He is described as having a thousand hands and a great devotee of god Dattatreya. One of the several such accounts states that Arjuna conquered Mahishmati city from Karkotaka Naga, a Naga chief and made it his fortress-capital.[1]
ne: Kartavirya Arjuna (Sanskrit: कार्तवीर्य अर्जुन, Kārtavīrya Arjuna; सहस्त्रबाहु अर्जुन ) प्राचीन हैहाया राज्यको एक राजा थिए । यो राज्य नर्मदा नदीको किनारमा हालको भारतीय राज्य मध्य प्रदेशमा रहेको थियो । यो राज्यको राजधानी महिस्मतिमा रहेको थियो ।उनलाई सय हात भएका राजा र भगवान दत्तात्रेयका ठूला भक्त'को रुपमा बर्णन गरिएको छ । [1]

source: Kul Ratna Tuladhar
ne: कुल रत्न तुलाधर

source: Tuladhar's statue at the Institute of Engineering, Pulchok
ne: इन्जिनियरिङ अध्ययन संस्थान परिसरमा रहेको कुल रत्न तुलाधर प्रतिमा

source: He was appointed principal of Nepal Engineering Institute in Lalitpur in 1962, subsequently becoming the first dean of the Institute of Engineering, Tribhuvan University, Kathmandu in 1973. In 1977, he was appointed a member of the Public Service Commission by the king of Nepal in which capacity he served till 1983.
ne: उनी नेपाल इन्जिनियरिङ इन्स्टिच्युटको प्रथम प्रिन्सिपल नियुक्त भए , इन्जिनियरिङ अध्ययन संस्थान, त्रिभुवन विश्वविद्यालयको प्रथम डिन बने। १९७७ मा उनी लोक सेवा आयोगको सदस्यमा नियुक्त भए र उनले १९८३ सम्म सेवा गरे ।

source: Awards
ne: सम्मान

source: Tuladhar was decorated with the Honorary Commander of the Order of the British Empire (CBE) in 1962. He was awarded the Order of Gorkha Dakshina Bahu I Class in 1969 and the Order of Tri Shakti Patta II Class in 1983 by the king of Nepal.
ne: तिउलाधरलाई १९६२ मा बेलायतको सम्मानार्थ कमाण्डर " अडर अफ ब्रिटिश एम्पाएर" बाट सम्मानित गरियो । उनल्लाई तत्कालिन राजाले गोरखा दक्षिण बाहु प्रथम श्रेणी , र त्रिशक्ति पट्ट दोश्रो श्रेणीले सम्मानित गरेका थिए ।

source: Kul Ratna Tuladhar, CBE (Devanagari: कुल रत्न तुलाधर) (6 July 1918 – 2 March 1984) was the first chief engineer of Nepal's Public Works Department where he served since its establishment in 1951 till 1957.[1] The highlight of his term was the construction of Tribhuvan Highway which opened in 1956. This is Nepal's first highway and links the capital Kathmandu with the Indian border to the south.[2]
ne: कुल रत्न तुलाधर, CBE (Devanagari: कुल रत्न तुलाधर) (6 July 1918 – 2 March 1984) नेपालको निजामती बिभागको पहिलो मुख्य इन्जिनियर हुन् । उनले बि.सं २००८ देखि २०१४ सम्म सेवा गरे । [1] उनको मुख्य कार्यहरुमा त्रिभुवन राजपथको निर्माण पर्छ जुन राजमार्गले काठमाडौँ देखि दक्षिणी सिमाना सम्म जोड्थ्यो ।

source: Tuladhar also played a major role in the development of engineering education in Nepal's modern history.
ne: तुलाधरले नेपालको आधुनिक इतिहासमा इन्जिनियरिङ अध्ययन शिक्षा विकासमा ठूलो भूमिका निर्वाह गरेका छन् ।

source: Tuladhar was born in Asan, Kathmandu to father Asha Ratna and mother Laxmi Maya Tuladhar. After graduating from Durbar High School in Kathmandu in 1935, he enrolled in Tri-Chandra College in Kathmandu and studied Intermediate in Science, subsequently graduating from Patna University, India in 1937. Tuladhar then pursued further studies at Calcutta University and earned a Bachelor in Engineering in 1941.
ne: तुलाधरको जन्म काठमाडौँ असनमा बाबु आशा रत्न तुलाधार र आमा लक्ष्मी मया तुलाधर बाट भएको थियो । दरबार हाई स्कुलबाट पढाई पुरा गरेपछी उनी त्रिचन्द्र क्याम्पसमा भर्ना भएर आइ.एससी पढे र पटना विश्वविद्यालयबाट पढाई पुरा गरे । तुलाधरले कलकत्ता विश्वविद्यालयमा थप पढाईको लागि भर्ना भए जहाँ बाट उनले इन्जिनियरिङ को अध्ययन पुरा गरे ।

source: The Treaty of Thapathali was a treaty signed between the Tibetan Ganden Phodrang regime (then under administrative rule of the Qing dynasty) and the Kingdom of Nepal in Thapathali Durbar in Kathmandu, the capital of Nepal, following the Nepalese–Tibetan War. In January 1856, a representative group of Tibet came to Kathmandu for discussion of the treaty. After a long discussion, the representative group ultimately signed in Thapathali a treaty on 24 March.
ne: थापाथली सन्धि तिब्बत (चिङ वंश मातहत) र नेपाल अधिराज्य बीच थापाथली दरबारमा भएको सन्धि हो । १९१२ पुस मा तिब्बती प्रतिनिधि मण्डल सन्धि बार्ता सुरु भयो । लामो छलफलपछी , प्रतिनिधि मण्डल बीच १९१२ चैत्र ८ मा थापाथली दरबारमा सन्धि गरियो । यहि सन्धिलाई थापाथली सन्धि भनिन्छ ।

source: Second attempt and its Terms
ne: बुँदा

source: The penalty paid by Tibetan and Nepali during the disputes will be given to Tibet government and Nepali government respectively. If any murderer escaped from a country and resides in other country, the latter will submit the culprit to concerned government. If any citizen of one country theft the citizens of other, the former government shall make all the provisions for returning materials and punish culprit.
ne: तिब्बत सरकारले नेपाल सरकारलाई बर्षेनी रु १०,००० नेपाली रुपैया बुझाउनु पर्नेछ । तिब्बत र नेपाल चिनियाँ सम्राटलाई सम्मानका साथ मान्छन । तिब्बत माथि कुनै तेश्रो पक्षबाट आक्रमण भएमा , नेपाल सरकारले तिब्बत सरकारलाई सहयोग गर्नेछ । यदि नेपालमा आक्रमण भएको खण्डमा , तिब्बत सरकारले नेपाली धनजनको रक्षा गर्नेछ तथा सुरक्षित स्थानमा सार्नेछ । यसको परिवहन खर्च पहिलो दुई महिना तिब्बत सरकारले व्यहोर्नेछ र त्यसपछिको नेपाल सरकारले व्यहोर्नेछ । नेपाल तथा तिब्बत बीचको व्यापारमा , तिब्बत सरकारले नेपाली उत्पादनमा कुनै भन्सार लगाउने छैन । Aसाथै यस सन्धि भन्दा अघि लगाइएका भन्सार पनि मिनाहा गरिनेछ । तिब्बत साराकरले नेपालका सम्पूर्ण युद्धि बन्दि र हतियार बुझाउनु पर्नेछ । साथै नेपाल सरकारले पनि युद्धको समयमा लिएका युद्धबन्दी तथा याकहरु बुझाउनु पर्नेछ । नेपाली व्यापारीको रेखदेखको लागि , अब उप्रान्त नेपाल सरकारको प्रतिनिधिको रुपमा नायक को सट्टा भारदार नियुक्त हुनेछ । तिब्बतमा व्यापार गर्न सबै नेपालीलाई बिना रोकतोक अनुमति हुनेछ । सशत्र सैनिक बाहेक, सबै नेपालीलाई तिब्बतमा स्वतन्त्रतापुर्वक हिडडुल गर्न अनुमति हुनेछ । नेपाली प्रतिनिधि ले तिब्बतको आन्तरिक मामिलामा कुनै हस्तक्षेप गर्ने छैन, साथै नेपाल भित्रको कुनै विवादमा तिब्बत सरकारले हस्तक्षेप गर्ने छैन । Bतर तिब्बत र नेपालवीचको विवाद को लागि, विवाद समाधानको लागि दुवै सरकारले एक एक प्रतिनिधि नियुक्त गर्नेछ। यदि कुनै अपराधी एक देश बाट उम्केर दोश्रो देशमा बसेमा, दोश्रो देशले सो अपराधी सम्बन्धित सरकारलाई सुपुर्दुगी गर्नेछ । यदि कुनै देशको नागरिकले अर्को देशको नागरिकको छोरि गरेमा , सो देशले पिडितको सम्पूर्ण सम्पति फिर्ताको व्यवस्था र अपराधीलाई सजायको व्यबस्था गर्नेछ ।

source: Thapathali Durbar History of Nepal Tibet under Qing rule Sino-Nepalese War Nepalese–Tibetan War China-Nepal relations
ne: थापाथली दरबार नेपालको इतिहास नेपाल –तिब्बत /चीन युद्ध अन्तिम नेपाल तिब्बत युद्ध

source: Budhathoki was born and grew up in Kathmandu. He has an MA in International Relations from the University of Northampton.[1] Arun is currently enrolled with the University of New Brunswick for MPhil degree.
ne: Budhathoki was born and grew up in Kathmandu. उहाँले एउटा MA मा अन्तर्राष्ट्रिय सम्बन्ध from the University of Northampton.[1] अरुण हाल भर्ना संग विश्वविद्यालय को नयाँ ब्रन्स्विक लागि MPhil डिग्री ।

source: Retrieved 14 February 2014..mw-parser-output cite.citation{font-style:inherit}.mw-parser-output q{quotes:"\"""\"""'""'"}.mw-parser-output code.cs1-code{color:inherit;background:inherit;border:inherit;padding:inherit}.mw-parser-output .cs1-lock-free a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/6/65/Lock-green.svg/9px-Lock-green.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-limited a,.mw-parser-output .cs1-lock-registration a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/d/d6/Lock-gray-alt-2.svg/9px-Lock-gray-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-lock-subscription a{background:url("//upload.wikimedia.org/wikipedia/commons/thumb/a/aa/Lock-red-alt-2.svg/9px-Lock-red-alt-2.svg.png")no-repeat;background-position:right .1em center}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration{color:#555}.mw-parser-output .cs1-subscription span,.mw-parser-output .cs1-registration span{border-bottom:1px dotted;cursor:help}.mw-parser-output .cs1-hidden-error{display:none;font-size:100%}.mw-parser-output .cs1-visible-error{font-size:100%}.mw-parser-output .cs1-subscription,.mw-parser-output .cs1-registration,.mw-parser-output .cs1-format{font-size:95%}.mw-parser-output .cs1-kern-left,.mw-parser-output .cs1-kern-wl-left{padding-left:0.2em}.mw-parser-output .cs1-kern-right,.mw-parser-output .cs1-kern-wl-right{padding-right:0.2em} ↑ "Arun Budhathoki".
ne: Retrieved 14 February 2014. ↑ "Arun Budhathoki".

source: His works have appeared in India Today, The Huffington Post (India),[2] Daily O, The Diplomat, The Citizen (India), Republica, The Kathmandu Post, Asia Pacific Daily, The Globe and Mail, TRT World, and The New Arab.
ne: His works have appeared in India Today, The Huffington Post (India),[1] Daily O, The Diplomat, The Citizen (India), Republica, The Kathmandu Post, Asia Pacific Daily, The Globe and Mail, TRT World, and The New Arab.

source: He also has worked as a stringer/fixer for The Globe and Mail.[3] He was the Nepal Editor for The Citizen (India).[4][5].
ne: He also has worked as a stringer/fixer for The Globe and Mail.[2] He was the Nepal Editor for The Citizen (India).[3][4].

source: Edge,[6] his first poetry book was published on 2011 and launched on January 24, 2012 by Nepali poet Yuyutsu Sharma,[7] novella The Lost Boys of Kathmandu as ebook format in Amazon.com on May 30, 2012[8] and Poems on Sikkim.[9] Edge was favorably reviewed by Cha: An Asian Literary Journal.[10][11] His poems have appeared in The Kathmandu Post,[12][13] The Weather Report,[14] and poems selected and published in Journeys[15] (anthologies by Sampad), Happy Birthday to Me[16] (anthology by The Asian Writer) and Inspired by Tagore.[17] He's also regularly featured in MadSwirl[18] and is the founder for The Applicant,[19][20] which was an online magazine.
ne: Edge,[1] his first poetry book was published on 2011 and launched on January 24, 2012 by Nepali poet Yuyutsu Sharma,[2] novella The Lost Boys of Kathmandu as ebook format in Amazon.com on May 30, 2012[3] and Poems on Sikkim.[4] Edge was favorably reviewed by Cha: An Asian Literary Journal.[5][6] His poems have appeared in The Kathmandu Post,[7][8] The Weather Report,[9] and poems selected and published in Journeys[10] (anthologies by Sampad), Happy Birthday to Me[11] (anthology by The Asian Writer) and Inspired by Tagore.[12] He's also regularly featured in MadSwirl[13] and is the founder for The Applicant,[14][15] which was an online magazine.

source: He was interviewed by República about getting published in Nepal.[21] His poetry book Prisoner of an iPad is released.[22][23] His poems have been published in various journals.[24][25][26][27] He was a contributor to The Brunswickan.[28]
ne: He was interviewed by República about getting published in Nepal.[16] His poetry book Prisoner of an iPad is released.[17][18] His poems have been published in various journals.[19][20][21][22] He was a contributor to The Brunswickan.[23]

source: Samrajya Lakshmi Devi (ca. 1814– 6 October 1841) was, as the senior wife of King Rajendra of Nepal, a queen consort of Nepal. She was the mother of King Surendra and Prince Upendra.
ne: साम्राज्य लक्ष्मी देवी राजा राजेन्द्रको जेठी रानी, नेपालको बडामहारानी थिइन् । उनी राजा सुरेन्द्र र अधि राजकुमार उपेन्द्रको आमा पनि हुन ।

source: Samrajya was the de facto regent from 1839 to 1841.
ne: साम्राज्य लक्ष्मी १८९६ देखि १८९८ वास्तविक शासक थिइन् । उनी काशी तर्फ जाँदा हेटौंडामा औलोको कारण १८९८ मा मृत्यु भयो । Samrajya was the de facto regent from 1839 to 1841.

source: She was very anxious about the power asserted by the Mukhtiyar Bhimsen Thapa.
ne: मुख्तियार भीमसेन थापाले सबै राजकीय अधिकार लिएकाले उनी क्रोधित थिइन् । उनले मुखियार संग भएका सबै अधिकार लिन राजा राजेन्द्रलाई उकसाइन She was very anxious about the power asserted by the Mukhtiyar Bhimsen Thapa.

source: The Nepali Ambassador in Washington, D. C. is the official representative of Nepal to the United States.[1]
ne: वासिङ्टन, डी.सी. मा रहने नेपाली राजदुत नेपालका तर्फ बाट संयुक्त राज्य अमेरिकाको लागि अधिकारिक प्रतिनिधि हुन् ।.[1]

source: List of representatives
ne: राजदुतको सुची

source: Tulsi Giri Lyndon B. Johnson April 4, 1969 April 17, 1969 Kul Shekhar Sharma [id] Kirti Nidhi Bista Richard Nixon April 27, 1973 June 14, 1973 Yadunath Khanal Nagendra Prasad Rijal Richard Nixon May 25, 1975 Bishweshwar Prasad Rimal Chargé d'affaires Tulsi Giri Gerald Ford January 9, 1976 January 23, 1976 Padma Bahadur Khatri Previously served as an ambassador from 1964–1969.
ne: Tulsi Giri Lyndon B. Johnson April 4, 1969 April 17, 1969 Kul Shekhar Sharma [id] Kirti Nidhi Bista Richard Nixon April 27, 1973 June 14, 1973 यदुनाथ खनाल Nagendra Prasad Rijal Richard Nixon May 25, 1975 Bishweshwar Prasad Rimal Chargé d'affaires Tulsi Giri Gerald Ford January 9, 1976 January 23, 1976 Padma Bahadur Khatri Previously served as an ambassador from 1964–1969.

source: The Nepali ambassador in Beijing is the official representative of the Government in Kathmandu to the Government of the People's Republic of China.
ne: बेइजिङमा रहने नेपाली राजदुत जनवादी गणतन्त्र चीनको लागि नेपाल सरकार अधिकारिक प्रतिनिधि हुन् ।

source: From 1954 to 1956 he was Ambassador to the Court of St James with concurren accreditation in Paris, The Hague and Washington, D.C.. From 1956 to 1961 he was ambassador to New Delhi and concurrent acredited to Japan 1956-1961, PRC 1956-1961, Ceylon 1957-1961 and Pakistan 1960-1961). In 1972 he became member of the Royal Nepal Academy.
ne: Diplomatic agrément/Diplomatic accreditation ambassador Observations List of Prime Ministers of Nepal Premier of the People's Republic of China Term end August 1, 1955 The governments in Kathmandu and Beijing establish diplomatic relations.
